//====================================================================
//  工学部「情報環境実験２」(富永)  C言語プログラミング
//  ポーカーゲームの戦略
//--------------------------------------------------------------------
//  Poker  usr/s16t287_02/  PokerOpe.c
//--------------------------------------------------------------------
//  米谷研究室  s16t287 檜垣大地
//  2018.12.27
//====================================================================


//====================================================================
//  仕様
//====================================================================

/*--------------------------------------------------------------------
---------------------------------------------------------------------*/


//====================================================================
//  前処理
//====================================================================

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

#include "Poker.h"

//--------------------------------------------------------------------
//  関数宣言
//--------------------------------------------------------------------

void copyArray(int *Array_Origin, int *Array_dest);
void analyzeHand(int *myhd, int *symIndex, int *numIndex);
int  decide_trash(int lock_length);

//====================================================================
//  戦略
//====================================================================

/*--------------------------------------------------------------------
//  ユーザ指定
//--------------------------------------------------------------------

最初の手札のまま交換しない。

hd : 手札配列
fd : 場札配列(テイク内の捨札)
cg : チェンジ数
tk : テイク数
ud : 捨札配列(過去のテイクも含めた全ての捨札)
us : 捨札数

--------------------------------------------------------------------*/

int strategy(int hd[], int fd[], int cg, int tk, int ud[], int us)
{
  int lock_length = 0;                             // 確定させた手札の長さ
  int myhd[HNUM] = {0};                            // コピーした手札
  int myhd_index[HNUM] = {0, 1, 2, 3, 4};          // 手札の元の配列位置
  int numIndex[13] = {0};                          // 数位的解析情報
  int symIndex[4]  = {0};                          // 記号的解析情報

  srand((unsigned)time(NULL));

  copyArray(hd, myhd);

  return decide_trash(lock_length);
}


//====================================================================
//  補助関数
//====================================================================

void copyArray(int *Array_Origin, int *Array_dest){
	int i;
	for (i = 0; i < HNUM; i++){
		Array_dest[i] = Array_Origin[i];
	}
	return;
}

void analyzeHand(int *myhd, int *symIndex, int *numIndex){
  int i;

  for (i = 0; i < HNUM; i++){
    symIndex[i] = myhd[i] / 13; numIndex[i] = myhd[i] % 13;
  }
  return;
}

int decide_trash(int lock_length){
  return rand() % ((HNUM + 1) - (lock_length)) - 1;
}
